In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
from warnings import filterwarnings
filterwarnings("ignore")

In [2]:
mydata = pd.read_csv('Batsman.csv')

mydata.head()

   RunsScored  BallsFaced  BattingPosition Dismissal  Inning Opposition  Year
0          12          22                2       LBW       1  Sri Lanka  2008
1          37          67                2    Caught       2  Sri Lanka  2008
2          25          38                1   Run out       1  Sri Lanka  2008
3          54          66                1    Bowled       1  Sri Lanka  2008
4          31          46                1       LBW       2  Sri Lanka  2008

In [3]:
mydata.shape

(208, 7)

In [4]:
mydata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 208 entries, 0 to 207
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   RunsScored       208 non-null    int64
 1   BallsFaced       208 non-null    int64
 2   BattingPosition  208 non-null    int64
 3   Dismissal        208 non-null    object
 4   Inning           208 non-null    int64
 5   Opposition       208 non-null    object
 6   Year             208 non-null    int64
dtypes: int64(5), object(2)
memory usage: 11.5+ KB

```
variables 
    1> Numercal - int
    2> Categorical - object

non-null => python's way to identify missing values   
```

In [5]:
mydata.describe()

       RunsScored  BallsFaced  BattingPosition      Inning         Year
count  208.000000  208.000000       208.000000  208.000000   208.000000
mean    49.192308   52.961538         3.264423    1.567308  2013.240385
std     43.797641   39.850548         0.781602    0.496644     2.750477
min      0.000000    0.000000         1.000000    1.000000  2008.000000
25%     10.750000   18.000000         3.000000    1.000000  2011.000000
50%     35.000000   46.500000         3.000000    2.000000  2013.000000
75%     81.250000   83.250000         3.000000    2.000000  2015.000000
max    183.000000  159.000000         7.000000    2.000000  2018.000000

#find 5 number summary helpful for exploratory data analysis

In [32]:
mydata.groupby('Opposition')['RunsScored'].sum().sort_values(ascending=False)

Opposition
Sri Lanka       2186
West Indies     1840
South Africa    1269
Australia       1182
New Zealand     1154
England         1112
Bangladesh       654
Pakistan         459
Zimbabwe         253
Ireland           78
U.A.E.            33
Netherlands       12
Name: RunsScored, dtype: int64

In [13]:
mydata.groupby('Opposition')['RunsScored'].mean().sort_values(ascending=False)

Opposition
New Zealand     60.736842
Bangladesh      59.454545
West Indies     57.500000
South Africa    52.875000
Sri Lanka       48.577778
Australia       45.461538
Zimbabwe        42.166667
Ireland         39.000000
England         38.344828
Pakistan        38.250000
U.A.E.          33.000000
Netherlands     12.000000
Name: RunsScored, dtype: float64

In [15]:
mydata.groupby('Year')['RunsScored'].sum().sort_values(ascending=False)

Year
2017    1460
2011    1381
2013    1268
2018    1202
2014    1054
2012    1026
2010     995
2016     739
2015     623
2009     325
2008     159
Name: RunsScored, dtype: int64

In [21]:
mydata.groupby(['Year', 'Opposition'])['RunsScored'].sum().sort_values(ascending=False)

Year  Opposition
2012  Sri Lanka       695
2018  South Africa    558
2011  West Indies     501
      England         472
2018  West Indies     453
2016  Australia       381
2014  Sri Lanka       377
2016  New Zealand     358
2013  Australia       344
      West Indies     339
2017  Sri Lanka       330
2010  Sri Lanka       307
2015  South Africa    291
2014  New Zealand     291
2017  New Zealand     263
      West Indies     244
2010  New Zealand     242
      Bangladesh      204
2013  England         198
      Zimbabwe        197
2011  South Africa    194
2014  West Indies     191
2018  England         191
2009  Sri Lanka       190
2017  England         185
2012  Pakistan        183
2017  Australia       180
2008  Sri Lanka       159
2014  Bangladesh      136
2010  Australia       118
2015  Pakistan        107
2011  Bangladesh      100
2017  Bangladesh       96
2013  Sri Lanka        93
2010  South Africa     88
2017  Pakistan         86
2012  Australia        82
2009  West Indies      79
2017  South Africa     76
2012  Bangladesh       66
2013  South Africa     62
2014  England          54
2015  Bangladesh       52
      Ireland          44
2009  Australia        40
2015  Zimbabwe         38
2013  Pakistan         35
2011  Sri Lanka        35
      Ireland          34
2015  U.A.E.           33
      West Indies      33
2011  Australia        24
2010  Pakistan         18
      Zimbabwe         18
2009  Pakistan         16
2015  Australia        13
2011  Netherlands      12
2015  England          12
2011  Pakistan          9
2014  Pakistan          5
Name: RunsScored, dtype: int64

In [22]:
mydata['Dismissal'].value_counts()

Dismissal
Caught        121
NO             37
Bowled         21
LBW            12
Run out        12
Stumped         4
Hit wicket      1
Name: count, dtype: int64

In [23]:
mydata.groupby(['Year', 'Opposition'])['RunsScored'].sum().sort_values(ascending=False).head(1)

Year  Opposition
2012  Sri Lanka     695
Name: RunsScored, dtype: int64

In [ ]:
mydata_runs = [mydata]['Run'].value_counts()

In [24]:
mydata.Opposition.unique()

array(['Sri Lanka', 'Pakistan', 'West Indies', 'Australia', 'Bangladesh',
       'South Africa', 'Zimbabwe', 'New Zealand', 'England', 'Ireland',
       'Netherlands', 'U.A.E.'], dtype=object)

In [25]:
mydata.groupby(['Opposition'])['RunsScored'].sum().sort_values(ascending=True).head(5)

Opposition
Netherlands     12
U.A.E.          33
Ireland         78
Zimbabwe       253
Pakistan       459
Name: RunsScored, dtype: int64

In [27]:
mydata.groupby('Inning')['RunsScored'].nunique()

Inning
1    57
2    81
Name: RunsScored, dtype: int64

In [31]:
mydata.groupby(['Opposition'])['RunsScored'].agg(['sum','median', 'sum'])

               sum  median   sum
Opposition
Australia     1182    29.0  1182
Bangladesh     654    66.0   654
England       1112    35.0  1112
Ireland         78    39.0    78
Netherlands     12    12.0    12
New Zealand   1154    64.0  1154
Pakistan       459    12.5   459
South Africa  1269    41.0  1269
Sri Lanka     2186    37.0  2186
U.A.E.          33    33.0    33
West Indies   1840    46.0  1840
Zimbabwe       253    28.0   253

In [35]:
pd.crosstab(index = mydata['Inning'],columns=mydata['Dismissal'],values=mydata['Dismissal'],margins=True,aggfunc='count')

#margin gives the sum of all

Dismissal  Bowled  Caught  Hit wicket   LBW    NO  Run out  Stumped  All
Inning
1            12.0    54.0         1.0   5.0   8.0     10.0      NaN   90
2             9.0    67.0         NaN   7.0  29.0      2.0      4.0  118
All          21.0   121.0         1.0  12.0  37.0     12.0      4.0  208

In [36]:
pd.crosstab(index = mydata['Inning'],columns=mydata['Dismissal'],values=mydata['Dismissal'],margins=False,aggfunc='count')

Dismissal  Bowled  Caught  Hit wicket  LBW    NO  Run out  Stumped
Inning
1            12.0    54.0         1.0  5.0   8.0     10.0      NaN
2             9.0    67.0         NaN  7.0  29.0      2.0      4.0

In [39]:
mydata['Strike_Rate'] = mydata['RunsScored']/mydata['BallsFaced']
mydata['post_transform'] = mydata['Year']>2012
mydata

,RunsScored,BallsFaced,BattingPosition,Dismissal,Inning,Opposition,Year,post_transform,Strike_Rate
0,12,22,2,LBW,1,Sri Lanka,2008,False,0.545455
1,37,67,2,Caught,2,Sri Lanka,2008,False,0.552239
2,25,38,1,Run out,1,Sri Lanka,2008,False,0.657895
3,54,66,1,Bowled,1,Sri Lanka,2008,False,0.818182
4,31,46,1,LBW,2,Sri Lanka,2008,False,0.673913
...,...,...,...,...,...,...,...,...,...
203,140,107,3,Stumped,2,West Indies,2018,True,1.308411
204,157,129,3,NO,1,West Indies,2018,True,1.217054
205,107,119,3,Bowled,2,West Indies,2018,True,0.899160
206,16,17,3,Caught,1,West Indies,2018,True,0.941176
207,33,29,3,NO,2,West Indies,2018,True,1.137931

In [42]:
mydata.groupby('post_transform')['RunsScored'].sum()

post_transform
False    3886
True     6346
Name: RunsScored, dtype: int64

In [47]:
mydata.groupby(['post_transform','Inning'])['RunsScored'].mean()

post_transform  Inning
False           1         36.421053
                2         50.040000
True            1         51.461538
                2         53.970588
Name: RunsScored, dtype: float64

In [50]:
pd.crosstab(index = mydata['post_transform'], columns=mydata['BattingPosition'], values=mydata['RunsScored'], margins=True, aggrfunc='sum')

TypeError: crosstab() got an unexpected keyword argument 'aggrfunc'